SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_vit.h
/** @} End of group EFR32FG25_VIT */

/**************************************************************************//**
 * @addtogroup EFR32FG25_VIT
 * @{
 * @defgroup EFR32FG25_VIT_BitFields VIT Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for VIT IPVERSION */
#define _VIT_IPVERSION_RESETVALUE            0x00000001UL                               /**< Default value for VIT_IPVERSION             */
#define _VIT_IPVERSION_MASK                  0xFFFFFFFFUL                               /**< Mask for VIT_IPVERSION                      */
#define _VIT_IPVERSION_IPVERSION_SHIFT       0                                          /**< Shift value for VIT_IPVERSION               */
#define _VIT_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                               /**< Bit mask for VIT_IPVERSION                  */
#define _VIT_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                               /**< Mode DEFAULT for VIT_IPVERSION              */
#define VIT_IPVERSION_IPVERSION_DEFAULT      (_VIT_IPVERSION_IPVERSION_DEFAULT << 0)    /**< Shifted mode DEFAULT for VIT_IPVERSION      */

/* Bit fields for VIT EN */
#define _VIT_EN_RESETVALUE                   0x00000000UL                               /**< Default value for VIT_EN                    */
#define _VIT_EN_MASK                         0x00000003UL                               /**< Mask for VIT_EN                             */
#define VIT_EN_EN                            (0x1UL << 0)                               /**< Module Enable                               */
#define _VIT_EN_EN_SHIFT                     0                                          /**< Shift value for VIT_EN                      */
#define _VIT_EN_EN_MASK                      0x1UL                                      /**< Bit mask for VIT_EN                         */
#define _VIT_EN_EN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for VIT_EN                     */
#define VIT_EN_EN_DEFAULT                    (_VIT_EN_EN_DEFAULT << 0)                  /**< Shifted mode DEFAULT for VIT_EN             */
#define VIT_EN_DISABLING                     (0x1UL << 1)                               /**< Disablement Busy Status                     */
#define _VIT_EN_DISABLING_SHIFT              1                                          /**< Shift value for VIT_DISABLING               */
#define _VIT_EN_DISABLING_MASK               0x2UL                                      /**< Bit mask for VIT_DISABLING                  */
#define _VIT_EN_DISABLING_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_EN                     */
#define VIT_EN_DISABLING_DEFAULT             (_VIT_EN_DISABLING_DEFAULT << 1)           /**< Shifted mode DEFAULT for VIT_EN             */

/* Bit fields for VIT SWRST */
#define _VIT_SWRST_RESETVALUE                0x00000000UL                               /**< Default value for VIT_SWRST                 */
#define _VIT_SWRST_MASK                      0x00000003UL                               /**< Mask for VIT_SWRST                          */
#define VIT_SWRST_SWRST                      (0x1UL << 0)                               /**< Software Reset Command                      */
#define _VIT_SWRST_SWRST_SHIFT               0                                          /**< Shift value for VIT_SWRST                   */
#define _VIT_SWRST_SWRST_MASK                0x1UL                                      /**< Bit mask for VIT_SWRST                      */
#define _VIT_SWRST_SWRST_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_SWRST                  */
#define VIT_SWRST_SWRST_DEFAULT              (_VIT_SWRST_SWRST_DEFAULT << 0)            /**< Shifted mode DEFAULT for VIT_SWRST          */
#define VIT_SWRST_RESETTING                  (0x1UL << 1)                               /**< Software Reset Busy Status                  */
#define _VIT_SWRST_RESETTING_SHIFT           1                                          /**< Shift value for VIT_RESETTING               */
#define _VIT_SWRST_RESETTING_MASK            0x2UL                                      /**< Bit mask for VIT_RESETTING                  */
#define _VIT_SWRST_RESETTING_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_SWRST                  */
#define VIT_SWRST_RESETTING_DEFAULT          (_VIT_SWRST_RESETTING_DEFAULT << 1)        /**< Shifted mode DEFAULT for VIT_SWRST          */

/* Bit fields for VIT CONNECT */
#define _VIT_CONNECT_RESETVALUE              0x00000000UL                               /**< Default value for VIT_CONNECT               */
#define _VIT_CONNECT_MASK                    0x00000101UL                               /**< Mask for VIT_CONNECT                        */
#define VIT_CONNECT_IN                       (0x1UL << 0)                               /**< Input FIFO connect                          */
#define _VIT_CONNECT_IN_SHIFT                0                                          /**< Shift value for VIT_IN                      */
#define _VIT_CONNECT_IN_MASK                 0x1UL                                      /**< Bit mask for VIT_IN                         */
#define _VIT_CONNECT_IN_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for VIT_CONNECT                */
#define VIT_CONNECT_IN_DEFAULT               (_VIT_CONNECT_IN_DEFAULT << 0)             /**< Shifted mode DEFAULT for VIT_CONNECT        */
#define VIT_CONNECT_OUT                      (0x1UL << 8)                               /**< Output FIFO connect                         */
#define _VIT_CONNECT_OUT_SHIFT               8                                          /**< Shift value for VIT_OUT                     */
#define _VIT_CONNECT_OUT_MASK                0x100UL                                    /**< Bit mask for VIT_OUT                        */
#define _VIT_CONNECT_OUT_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_CONNECT                */
#define VIT_CONNECT_OUT_DEFAULT              (_VIT_CONNECT_OUT_DEFAULT << 8)            /**< Shifted mode DEFAULT for VIT_CONNECT        */

/* Bit fields for VIT DISCLK */
#define _VIT_DISCLK_RESETVALUE               0x00000002UL                               /**< Default value for VIT_DISCLK                */
#define _VIT_DISCLK_MASK                     0x00000003UL                               /**< Mask for VIT_DISCLK                         */
#define _VIT_DISCLK_DISCLK_SHIFT             0                                          /**< Shift value for VIT_DISCLK                  */
#define _VIT_DISCLK_DISCLK_MASK              0x3UL                                      /**< Bit mask for VIT_DISCLK                     */
#define _VIT_DISCLK_DISCLK_DEFAULT           0x00000002UL                               /**< Mode DEFAULT for VIT_DISCLK                 */
#define _VIT_DISCLK_DISCLK_NONE              0x00000000UL                               /**< Mode NONE for VIT_DISCLK                    */
#define _VIT_DISCLK_DISCLK_ALL               0x00000001UL                               /**< Mode ALL for VIT_DISCLK                     */
#define _VIT_DISCLK_DISCLK_AUTO              0x00000002UL                               /**< Mode AUTO for VIT_DISCLK                    */
#define VIT_DISCLK_DISCLK_DEFAULT            (_VIT_DISCLK_DISCLK_DEFAULT << 0)          /**< Shifted mode DEFAULT for VIT_DISCLK         */
#define VIT_DISCLK_DISCLK_NONE               (_VIT_DISCLK_DISCLK_NONE << 0)             /**< Shifted mode NONE for VIT_DISCLK            */
#define VIT_DISCLK_DISCLK_ALL                (_VIT_DISCLK_DISCLK_ALL << 0)              /**< Shifted mode ALL for VIT_DISCLK             */
#define VIT_DISCLK_DISCLK_AUTO               (_VIT_DISCLK_DISCLK_AUTO << 0)             /**< Shifted mode AUTO for VIT_DISCLK            */

/* Bit fields for VIT FIFOIN */
#define _VIT_FIFOIN_RESETVALUE               0x00000000UL                               /**< Default value for VIT_FIFOIN                */
#define _VIT_FIFOIN_MASK                     0x1FFF3F0FUL                               /**< Mask for VIT_FIFOIN                         */
#define _VIT_FIFOIN_FID_SHIFT                0                                          /**< Shift value for VIT_FID                     */
#define _VIT_FIFOIN_FID_MASK                 0xFUL                                      /**< Bit mask for VIT_FID                        */
#define _VIT_FIFOIN_FID_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOIN                 */
#define VIT_FIFOIN_FID_DEFAULT               (_VIT_FIFOIN_FID_DEFAULT << 0)             /**< Shifted mode DEFAULT for VIT_FIFOIN         */
#define _VIT_FIFOIN_CID_SHIFT                8                                          /**< Shift value for VIT_CID                     */
#define _VIT_FIFOIN_CID_MASK                 0x3F00UL                                   /**< Bit mask for VIT_CID                        */
#define _VIT_FIFOIN_CID_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOIN                 */
#define VIT_FIFOIN_CID_DEFAULT               (_VIT_FIFOIN_CID_DEFAULT << 8)             /**< Shifted mode DEFAULT for VIT_FIFOIN         */
#define _VIT_FIFOIN_REM_SHIFT                16                                         /**< Shift value for VIT_REM                     */
#define _VIT_FIFOIN_REM_MASK                 0xFF0000UL                                 /**< Bit mask for VIT_REM                        */
#define _VIT_FIFOIN_REM_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOIN                 */
#define VIT_FIFOIN_REM_DEFAULT               (_VIT_FIFOIN_REM_DEFAULT << 16)            /**< Shifted mode DEFAULT for VIT_FIFOIN         */
#define _VIT_FIFOIN_ALARM_SHIFT              24                                         /**< Shift value for VIT_ALARM                   */
#define _VIT_FIFOIN_ALARM_MASK               0x1F000000UL                               /**< Bit mask for VIT_ALARM                      */
#define _VIT_FIFOIN_ALARM_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOIN                 */
#define VIT_FIFOIN_ALARM_DEFAULT             (_VIT_FIFOIN_ALARM_DEFAULT << 24)          /**< Shifted mode DEFAULT for VIT_FIFOIN         */

/* Bit fields for VIT FIFOOUT */
#define _VIT_FIFOOUT_RESETVALUE              0x00000000UL                               /**< Default value for VIT_FIFOOUT               */
#define _VIT_FIFOOUT_MASK                    0x1FFF0000UL                               /**< Mask for VIT_FIFOOUT                        */
#define _VIT_FIFOOUT_CNT_SHIFT               16                                         /**< Shift value for VIT_CNT                     */
#define _VIT_FIFOOUT_CNT_MASK                0xFF0000UL                                 /**< Bit mask for VIT_CNT                        */
#define _VIT_FIFOOUT_CNT_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOOUT                */
#define VIT_FIFOOUT_CNT_DEFAULT              (_VIT_FIFOOUT_CNT_DEFAULT << 16)           /**< Shifted mode DEFAULT for VIT_FIFOOUT        */
#define _VIT_FIFOOUT_ALARM_SHIFT             24                                         /**< Shift value for VIT_ALARM                   */
#define _VIT_FIFOOUT_ALARM_MASK              0x1F000000UL                               /**< Bit mask for VIT_ALARM                      */
#define _VIT_FIFOOUT_ALARM_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for VIT_FIFOOUT                */
#define VIT_FIFOOUT_ALARM_DEFAULT            (_VIT_FIFOOUT_ALARM_DEFAULT << 24)         /**< Shifted mode DEFAULT for VIT_FIFOOUT        */

/* Bit fields for VIT FMTIN */
#define _VIT_FMTIN_RESETVALUE                0x00000000UL                               /**< Default value for VIT_FMTIN                 */
#define _VIT_FMTIN_MASK                      0x00030300UL                               /**< Mask for VIT_FMTIN                          */
#define _VIT_FMTIN_ELEMNB_SHIFT              8                                          /**< Shift value for VIT_ELEMNB                  */
#define _VIT_FMTIN_ELEMNB_MASK               0x300UL                                    /**< Bit mask for VIT_ELEMNB                     */
#define _VIT_FMTIN_ELEMNB_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_FMTIN                  */
#define _VIT_FMTIN_ELEMNB_ONE                0x00000000UL                               /**< Mode ONE for VIT_FMTIN                      */
#define _VIT_FMTIN_ELEMNB_TWO                0x00000001UL                               /**< Mode TWO for VIT_FMTIN                      */
#define _VIT_FMTIN_ELEMNB_FOUR               0x00000002UL                               /**< Mode FOUR for VIT_FMTIN                     */
#define VIT_FMTIN_ELEMNB_DEFAULT             (_VIT_FMTIN_ELEMNB_DEFAULT << 8)           /**< Shifted mode DEFAULT for VIT_FMTIN          */
#define VIT_FMTIN_ELEMNB_ONE                 (_VIT_FMTIN_ELEMNB_ONE << 8)               /**< Shifted mode ONE for VIT_FMTIN              */
#define VIT_FMTIN_ELEMNB_TWO                 (_VIT_FMTIN_ELEMNB_TWO << 8)               /**< Shifted mode TWO for VIT_FMTIN              */
#define VIT_FMTIN_ELEMNB_FOUR                (_VIT_FMTIN_ELEMNB_FOUR << 8)              /**< Shifted mode FOUR for VIT_FMTIN             */
#define _VIT_FMTIN_ELEMALIGN_SHIFT           16                                         /**< Shift value for VIT_ELEMALIGN               */
#define _VIT_FMTIN_ELEMALIGN_MASK            0x30000UL                                  /**< Bit mask for VIT_ELEMALIGN                  */
#define _VIT_FMTIN_ELEMALIGN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_FMTIN                  */
#define _VIT_FMTIN_ELEMALIGN_WORD            0x00000000UL                               /**< Mode WORD for VIT_FMTIN                     */
#define _VIT_FMTIN_ELEMALIGN_HALFWORD        0x00000001UL                               /**< Mode HALFWORD for VIT_FMTIN                 */
#define _VIT_FMTIN_ELEMALIGN_BYTE            0x00000002UL                               /**< Mode BYTE for VIT_FMTIN                     */
#define VIT_FMTIN_ELEMALIGN_DEFAULT          (_VIT_FMTIN_ELEMALIGN_DEFAULT << 16)       /**< Shifted mode DEFAULT for VIT_FMTIN          */
#define VIT_FMTIN_ELEMALIGN_WORD             (_VIT_FMTIN_ELEMALIGN_WORD << 16)          /**< Shifted mode WORD for VIT_FMTIN             */
#define VIT_FMTIN_ELEMALIGN_HALFWORD         (_VIT_FMTIN_ELEMALIGN_HALFWORD << 16)      /**< Shifted mode HALFWORD for VIT_FMTIN         */
#define VIT_FMTIN_ELEMALIGN_BYTE             (_VIT_FMTIN_ELEMALIGN_BYTE << 16)          /**< Shifted mode BYTE for VIT_FMTIN             */

/* Bit fields for VIT FMTOUT */
#define _VIT_FMTOUT_RESETVALUE               0x00000000UL                               /**< Default value for VIT_FMTOUT                */
#define _VIT_FMTOUT_MASK                     0x0000001FUL                               /**< Mask for VIT_FMTOUT                         */
#define _VIT_FMTOUT_ELEMSIZE_SHIFT           0                                          /**< Shift value for VIT_ELEMSIZE                */
#define _VIT_FMTOUT_ELEMSIZE_MASK            0x1FUL                                     /**< Bit mask for VIT_ELEMSIZE                   */
#define _VIT_FMTOUT_ELEMSIZE_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_FMTOUT                 */
#define VIT_FMTOUT_ELEMSIZE_DEFAULT          (_VIT_FMTOUT_ELEMSIZE_DEFAULT << 0)        /**< Shifted mode DEFAULT for VIT_FMTOUT         */

