SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_vit.h
/* Bit fields for VIT CTRL */
#define _VIT_CTRL_RESETVALUE                 0x0000421EUL                               /**< Default value for VIT_CTRL                  */
#define _VIT_CTRL_MASK                       0xEEFFFFFFUL                               /**< Mask for VIT_CTRL                           */
#define VIT_CTRL_STRUCTURE                   (0x1UL << 0)                               /**< New BitField                                */
#define _VIT_CTRL_STRUCTURE_SHIFT            0                                          /**< Shift value for VIT_STRUCTURE               */
#define _VIT_CTRL_STRUCTURE_MASK             0x1UL                                      /**< Bit mask for VIT_STRUCTURE                  */
#define _VIT_CTRL_STRUCTURE_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define _VIT_CTRL_STRUCTURE_non_recursive    0x00000000UL                               /**< Mode non_recursive for VIT_CTRL             */
#define _VIT_CTRL_STRUCTURE_recursive        0x00000001UL                               /**< Mode recursive for VIT_CTRL                 */
#define VIT_CTRL_STRUCTURE_DEFAULT           (_VIT_CTRL_STRUCTURE_DEFAULT << 0)         /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_STRUCTURE_non_recursive     (_VIT_CTRL_STRUCTURE_non_recursive << 0)   /**< Shifted mode non_recursive for VIT_CTRL     */
#define VIT_CTRL_STRUCTURE_recursive         (_VIT_CTRL_STRUCTURE_recursive << 0)       /**< Shifted mode recursive for VIT_CTRL         */
#define _VIT_CTRL_CONSTLENGTH_SHIFT          1                                          /**< Shift value for VIT_CONSTLENGTH             */
#define _VIT_CTRL_CONSTLENGTH_MASK           0xEUL                                      /**< Bit mask for VIT_CONSTLENGTH                */
#define _VIT_CTRL_CONSTLENGTH_DEFAULT        0x00000007UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_CONSTLENGTH_DEFAULT         (_VIT_CTRL_CONSTLENGTH_DEFAULT << 1)       /**< Shifted mode DEFAULT for VIT_CTRL           */
#define _VIT_CTRL_PUNCTPERIOD_SHIFT          4                                          /**< Shift value for VIT_PUNCTPERIOD             */
#define _VIT_CTRL_PUNCTPERIOD_MASK           0x70UL                                     /**< Bit mask for VIT_PUNCTPERIOD                */
#define _VIT_CTRL_PUNCTPERIOD_DEFAULT        0x00000001UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_PUNCTPERIOD_DEFAULT         (_VIT_CTRL_PUNCTPERIOD_DEFAULT << 4)       /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_TAILEN                      (0x1UL << 7)                               /**< New BitField                                */
#define _VIT_CTRL_TAILEN_SHIFT               7                                          /**< Shift value for VIT_TAILEN                  */
#define _VIT_CTRL_TAILEN_MASK                0x80UL                                     /**< Bit mask for VIT_TAILEN                     */
#define _VIT_CTRL_TAILEN_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_TAILEN_DEFAULT              (_VIT_CTRL_TAILEN_DEFAULT << 7)            /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_PMINIT                      (0x1UL << 8)                               /**< New BitField                                */
#define _VIT_CTRL_PMINIT_SHIFT               8                                          /**< Shift value for VIT_PMINIT                  */
#define _VIT_CTRL_PMINIT_MASK                0x100UL                                    /**< Bit mask for VIT_PMINIT                     */
#define _VIT_CTRL_PMINIT_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_PMINIT_DEFAULT              (_VIT_CTRL_PMINIT_DEFAULT << 8)            /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_PMTAIL                      (0x1UL << 9)                               /**< New BitField                                */
#define _VIT_CTRL_PMTAIL_SHIFT               9                                          /**< Shift value for VIT_PMTAIL                  */
#define _VIT_CTRL_PMTAIL_MASK                0x200UL                                    /**< Bit mask for VIT_PMTAIL                     */
#define _VIT_CTRL_PMTAIL_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_PMTAIL_DEFAULT              (_VIT_CTRL_PMTAIL_DEFAULT << 9)            /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_SSUMETHOD                   (0x1UL << 10)                              /**< New BitField                                */
#define _VIT_CTRL_SSUMETHOD_SHIFT            10                                         /**< Shift value for VIT_SSUMETHOD               */
#define _VIT_CTRL_SSUMETHOD_MASK             0x400UL                                    /**< Bit mask for VIT_SSUMETHOD                  */
#define _VIT_CTRL_SSUMETHOD_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define _VIT_CTRL_SSUMETHOD_RE               0x00000000UL                               /**< Mode RE for VIT_CTRL                        */
#define _VIT_CTRL_SSUMETHOD_TB               0x00000001UL                               /**< Mode TB for VIT_CTRL                        */
#define VIT_CTRL_SSUMETHOD_DEFAULT           (_VIT_CTRL_SSUMETHOD_DEFAULT << 10)        /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_SSUMETHOD_RE                (_VIT_CTRL_SSUMETHOD_RE << 10)             /**< Shifted mode RE for VIT_CTRL                */
#define VIT_CTRL_SSUMETHOD_TB                (_VIT_CTRL_SSUMETHOD_TB << 10)             /**< Shifted mode TB for VIT_CTRL                */
#define _VIT_CTRL_TRUNCLENGTH_SHIFT          11                                         /**< Shift value for VIT_TRUNCLENGTH             */
#define _VIT_CTRL_TRUNCLENGTH_MASK           0x7800UL                                   /**< Bit mask for VIT_TRUNCLENGTH                */
#define _VIT_CTRL_TRUNCLENGTH_DEFAULT        0x00000008UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define _VIT_CTRL_TRUNCLENGTH_TL0            0x00000000UL                               /**< Mode TL0 for VIT_CTRL                       */
#define _VIT_CTRL_TRUNCLENGTH_TL8            0x00000001UL                               /**< Mode TL8 for VIT_CTRL                       */
#define _VIT_CTRL_TRUNCLENGTH_TL16           0x00000002UL                               /**< Mode TL16 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL24           0x00000003UL                               /**< Mode TL24 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL32           0x00000004UL                               /**< Mode TL32 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL40           0x00000005UL                               /**< Mode TL40 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL48           0x00000006UL                               /**< Mode TL48 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL56           0x00000007UL                               /**< Mode TL56 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL64           0x00000008UL                               /**< Mode TL64 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL72           0x00000009UL                               /**< Mode TL72 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL80           0x0000000AUL                               /**< Mode TL80 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL88           0x0000000BUL                               /**< Mode TL88 for VIT_CTRL                      */
#define _VIT_CTRL_TRUNCLENGTH_TL96           0x0000000CUL                               /**< Mode TL96 for VIT_CTRL                      */
#define VIT_CTRL_TRUNCLENGTH_DEFAULT         (_VIT_CTRL_TRUNCLENGTH_DEFAULT << 11)      /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_TRUNCLENGTH_TL0             (_VIT_CTRL_TRUNCLENGTH_TL0 << 11)          /**< Shifted mode TL0 for VIT_CTRL               */
#define VIT_CTRL_TRUNCLENGTH_TL8             (_VIT_CTRL_TRUNCLENGTH_TL8 << 11)          /**< Shifted mode TL8 for VIT_CTRL               */
#define VIT_CTRL_TRUNCLENGTH_TL16            (_VIT_CTRL_TRUNCLENGTH_TL16 << 11)         /**< Shifted mode TL16 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL24            (_VIT_CTRL_TRUNCLENGTH_TL24 << 11)         /**< Shifted mode TL24 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL32            (_VIT_CTRL_TRUNCLENGTH_TL32 << 11)         /**< Shifted mode TL32 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL40            (_VIT_CTRL_TRUNCLENGTH_TL40 << 11)         /**< Shifted mode TL40 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL48            (_VIT_CTRL_TRUNCLENGTH_TL48 << 11)         /**< Shifted mode TL48 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL56            (_VIT_CTRL_TRUNCLENGTH_TL56 << 11)         /**< Shifted mode TL56 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL64            (_VIT_CTRL_TRUNCLENGTH_TL64 << 11)         /**< Shifted mode TL64 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL72            (_VIT_CTRL_TRUNCLENGTH_TL72 << 11)         /**< Shifted mode TL72 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL80            (_VIT_CTRL_TRUNCLENGTH_TL80 << 11)         /**< Shifted mode TL80 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL88            (_VIT_CTRL_TRUNCLENGTH_TL88 << 11)         /**< Shifted mode TL88 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTH_TL96            (_VIT_CTRL_TRUNCLENGTH_TL96 << 11)         /**< Shifted mode TL96 for VIT_CTRL              */
#define VIT_CTRL_TRUNCLENGTHUNIT             (0x1UL << 15)                              /**< New BitField                                */
#define _VIT_CTRL_TRUNCLENGTHUNIT_SHIFT      15                                         /**< Shift value for VIT_TRUNCLENGTHUNIT         */
#define _VIT_CTRL_TRUNCLENGTHUNIT_MASK       0x8000UL                                   /**< Bit mask for VIT_TRUNCLENGTHUNIT            */
#define _VIT_CTRL_TRUNCLENGTHUNIT_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define _VIT_CTRL_TRUNCLENGTHUNIT_EIGHT      0x00000000UL                               /**< Mode EIGHT for VIT_CTRL                     */
#define _VIT_CTRL_TRUNCLENGTHUNIT_TWELVE     0x00000001UL                               /**< Mode TWELVE for VIT_CTRL                    */
#define VIT_CTRL_TRUNCLENGTHUNIT_DEFAULT     (_VIT_CTRL_TRUNCLENGTHUNIT_DEFAULT << 15)  /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_TRUNCLENGTHUNIT_EIGHT       (_VIT_CTRL_TRUNCLENGTHUNIT_EIGHT << 15)    /**< Shifted mode EIGHT for VIT_CTRL             */
#define VIT_CTRL_TRUNCLENGTHUNIT_TWELVE      (_VIT_CTRL_TRUNCLENGTHUNIT_TWELVE << 15)   /**< Shifted mode TWELVE for VIT_CTRL            */
#define _VIT_CTRL_CKRATIO_SHIFT              16                                         /**< Shift value for VIT_CKRATIO                 */
#define _VIT_CTRL_CKRATIO_MASK               0xF0000UL                                  /**< Bit mask for VIT_CKRATIO                    */
#define _VIT_CTRL_CKRATIO_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_CKRATIO_DEFAULT             (_VIT_CTRL_CKRATIO_DEFAULT << 16)          /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_SYNDMODE                    (0x1UL << 20)                              /**< New BitField                                */
#define _VIT_CTRL_SYNDMODE_SHIFT             20                                         /**< Shift value for VIT_SYNDMODE                */
#define _VIT_CTRL_SYNDMODE_MASK              0x100000UL                                 /**< Bit mask for VIT_SYNDMODE                   */
#define _VIT_CTRL_SYNDMODE_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define _VIT_CTRL_SYNDMODE_LEGACY            0x00000000UL                               /**< Mode LEGACY for VIT_CTRL                    */
#define _VIT_CTRL_SYNDMODE_NEW               0x00000001UL                               /**< Mode NEW for VIT_CTRL                       */
#define VIT_CTRL_SYNDMODE_DEFAULT            (_VIT_CTRL_SYNDMODE_DEFAULT << 20)         /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_SYNDMODE_LEGACY             (_VIT_CTRL_SYNDMODE_LEGACY << 20)          /**< Shifted mode LEGACY for VIT_CTRL            */
#define VIT_CTRL_SYNDMODE_NEW                (_VIT_CTRL_SYNDMODE_NEW << 20)             /**< Shifted mode NEW for VIT_CTRL               */
#define _VIT_CTRL_INV_SHIFT                  21                                         /**< Shift value for VIT_INV                     */
#define _VIT_CTRL_INV_MASK                   0xE00000UL                                 /**< Bit mask for VIT_INV                        */
#define _VIT_CTRL_INV_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_INV_DEFAULT                 (_VIT_CTRL_INV_DEFAULT << 21)              /**< Shifted mode DEFAULT for VIT_CTRL           */
#define _VIT_CTRL_NONSYST_SHIFT              25                                         /**< Shift value for VIT_NONSYST                 */
#define _VIT_CTRL_NONSYST_MASK               0xE000000UL                                /**< Bit mask for VIT_NONSYST                    */
#define _VIT_CTRL_NONSYST_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_NONSYST_DEFAULT             (_VIT_CTRL_NONSYST_DEFAULT << 25)          /**< Shifted mode DEFAULT for VIT_CTRL           */
#define _VIT_CTRL_RECURSEL_SHIFT             29                                         /**< Shift value for VIT_RECURSEL                */
#define _VIT_CTRL_RECURSEL_MASK              0x60000000UL                               /**< Bit mask for VIT_RECURSEL                   */
#define _VIT_CTRL_RECURSEL_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_RECURSEL_DEFAULT            (_VIT_CTRL_RECURSEL_DEFAULT << 29)         /**< Shifted mode DEFAULT for VIT_CTRL           */
#define VIT_CTRL_MAPINVERT                   (0x1UL << 31)                              /**< New BitField                                */
#define _VIT_CTRL_MAPINVERT_SHIFT            31                                         /**< Shift value for VIT_MAPINVERT               */
#define _VIT_CTRL_MAPINVERT_MASK             0x80000000UL                               /**< Bit mask for VIT_MAPINVERT                  */
#define _VIT_CTRL_MAPINVERT_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for VIT_CTRL                   */
#define VIT_CTRL_MAPINVERT_DEFAULT           (_VIT_CTRL_MAPINVERT_DEFAULT << 31)        /**< Shifted mode DEFAULT for VIT_CTRL           */

