SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_vit.h
/* Bit fields for VIT POLY */
#define _VIT_POLY_RESETVALUE                 0x006D6D6DUL                               /**< Default value for VIT_POLY                  */
#define _VIT_POLY_MASK                       0x007F7F7FUL                               /**< Mask for VIT_POLY                           */
#define _VIT_POLY_POLY0_SHIFT                0                                          /**< Shift value for VIT_POLY0                   */
#define _VIT_POLY_POLY0_MASK                 0x7FUL                                     /**< Bit mask for VIT_POLY0                      */
#define _VIT_POLY_POLY0_DEFAULT              0x0000006DUL                               /**< Mode DEFAULT for VIT_POLY                   */
#define VIT_POLY_POLY0_DEFAULT               (_VIT_POLY_POLY0_DEFAULT << 0)             /**< Shifted mode DEFAULT for VIT_POLY           */
#define _VIT_POLY_POLY1_SHIFT                8                                          /**< Shift value for VIT_POLY1                   */
#define _VIT_POLY_POLY1_MASK                 0x7F00UL                                   /**< Bit mask for VIT_POLY1                      */
#define _VIT_POLY_POLY1_DEFAULT              0x0000006DUL                               /**< Mode DEFAULT for VIT_POLY                   */
#define VIT_POLY_POLY1_DEFAULT               (_VIT_POLY_POLY1_DEFAULT << 8)             /**< Shifted mode DEFAULT for VIT_POLY           */
#define _VIT_POLY_POLY2_SHIFT                16                                         /**< Shift value for VIT_POLY2                   */
#define _VIT_POLY_POLY2_MASK                 0x7F0000UL                                 /**< Bit mask for VIT_POLY2                      */
#define _VIT_POLY_POLY2_DEFAULT              0x0000006DUL                               /**< Mode DEFAULT for VIT_POLY                   */
#define VIT_POLY_POLY2_DEFAULT               (_VIT_POLY_POLY2_DEFAULT << 16)            /**< Shifted mode DEFAULT for VIT_POLY           */

/* Bit fields for VIT PUNCT */
#define _VIT_PUNCT_RESETVALUE                0x00010101UL                               /**< Default value for VIT_PUNCT                 */
#define _VIT_PUNCT_MASK                      0x00FFFFFFUL                               /**< Mask for VIT_PUNCT                          */
#define _VIT_PUNCT_PUNCT0_SHIFT              0                                          /**< Shift value for VIT_PUNCT0                  */
#define _VIT_PUNCT_PUNCT0_MASK               0xFFUL                                     /**< Bit mask for VIT_PUNCT0                     */
#define _VIT_PUNCT_PUNCT0_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for VIT_PUNCT                  */
#define VIT_PUNCT_PUNCT0_DEFAULT             (_VIT_PUNCT_PUNCT0_DEFAULT << 0)           /**< Shifted mode DEFAULT for VIT_PUNCT          */
#define _VIT_PUNCT_PUNCT1_SHIFT              8                                          /**< Shift value for VIT_PUNCT1                  */
#define _VIT_PUNCT_PUNCT1_MASK               0xFF00UL                                   /**< Bit mask for VIT_PUNCT1                     */
#define _VIT_PUNCT_PUNCT1_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for VIT_PUNCT                  */
#define VIT_PUNCT_PUNCT1_DEFAULT             (_VIT_PUNCT_PUNCT1_DEFAULT << 8)           /**< Shifted mode DEFAULT for VIT_PUNCT          */
#define _VIT_PUNCT_PUNCT2_SHIFT              16                                         /**< Shift value for VIT_PUNCT2                  */
#define _VIT_PUNCT_PUNCT2_MASK               0xFF0000UL                                 /**< Bit mask for VIT_PUNCT2                     */
#define _VIT_PUNCT_PUNCT2_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for VIT_PUNCT                  */
#define VIT_PUNCT_PUNCT2_DEFAULT             (_VIT_PUNCT_PUNCT2_DEFAULT << 16)          /**< Shifted mode DEFAULT for VIT_PUNCT          */

/* Bit fields for VIT FRAME */
#define _VIT_FRAME_RESETVALUE                0x00000000UL                               /**< Default value for VIT_FRAME                 */
#define _VIT_FRAME_MASK                      0x0003FFFFUL                               /**< Mask for VIT_FRAME                          */
#define _VIT_FRAME_LENGTH_SHIFT              0                                          /**< Shift value for VIT_LENGTH                  */
#define _VIT_FRAME_LENGTH_MASK               0x3FFFFUL                                  /**< Bit mask for VIT_LENGTH                     */
#define _VIT_FRAME_LENGTH_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_FRAME                  */
#define VIT_FRAME_LENGTH_DEFAULT             (_VIT_FRAME_LENGTH_DEFAULT << 0)           /**< Shifted mode DEFAULT for VIT_FRAME          */

/* Bit fields for VIT PM */
#define _VIT_PM_RESETVALUE                   0x00000000UL                               /**< Default value for VIT_PM                    */
#define _VIT_PM_MASK                         0x3FFFFF3FUL                               /**< Mask for VIT_PM                             */
#define _VIT_PM_STATEIDX_SHIFT               0                                          /**< Shift value for VIT_STATEIDX                */
#define _VIT_PM_STATEIDX_MASK                0x3FUL                                     /**< Bit mask for VIT_STATEIDX                   */
#define _VIT_PM_STATEIDX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_PM                     */
#define VIT_PM_STATEIDX_DEFAULT              (_VIT_PM_STATEIDX_DEFAULT << 0)            /**< Shifted mode DEFAULT for VIT_PM             */
#define _VIT_PM_STATEVAL_SHIFT               8                                          /**< Shift value for VIT_STATEVAL                */
#define _VIT_PM_STATEVAL_MASK                0x7FF00UL                                  /**< Bit mask for VIT_STATEVAL                   */
#define _VIT_PM_STATEVAL_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_PM                     */
#define VIT_PM_STATEVAL_DEFAULT              (_VIT_PM_STATEVAL_DEFAULT << 8)            /**< Shifted mode DEFAULT for VIT_PM             */
#define _VIT_PM_STATEDEF_SHIFT               19                                         /**< Shift value for VIT_STATEDEF                */
#define _VIT_PM_STATEDEF_MASK                0x3FF80000UL                               /**< Bit mask for VIT_STATEDEF                   */
#define _VIT_PM_STATEDEF_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for VIT_PM                     */
#define VIT_PM_STATEDEF_DEFAULT              (_VIT_PM_STATEDEF_DEFAULT << 19)           /**< Shifted mode DEFAULT for VIT_PM             */

/* Bit fields for VIT DISCLKCNT */
#define _VIT_DISCLKCNT_RESETVALUE            0x00000000UL                               /**< Default value for VIT_DISCLKCNT             */
#define _VIT_DISCLKCNT_MASK                  0x000000FFUL                               /**< Mask for VIT_DISCLKCNT                      */
#define _VIT_DISCLKCNT_DISCLKCNT_SHIFT       0                                          /**< Shift value for VIT_DISCLKCNT               */
#define _VIT_DISCLKCNT_DISCLKCNT_MASK        0xFFUL                                     /**< Bit mask for VIT_DISCLKCNT                  */
#define _VIT_DISCLKCNT_DISCLKCNT_DEFAULT     0x00000000UL                               /**< Mode DEFAULT for VIT_DISCLKCNT              */
#define VIT_DISCLKCNT_DISCLKCNT_DEFAULT      (_VIT_DISCLKCNT_DISCLKCNT_DEFAULT << 0)    /**< Shifted mode DEFAULT for VIT_DISCLKCNT      */

/* Bit fields for VIT STAT */
#define _VIT_STAT_RESETVALUE                 0x00000000UL                               /**< Default value for VIT_STAT                  */
#define _VIT_STAT_MASK                       0x0F013F3FUL                               /**< Mask for VIT_STAT                           */
#define _VIT_STAT_STATEMIN_SHIFT             0                                          /**< Shift value for VIT_STATEMIN                */
#define _VIT_STAT_STATEMIN_MASK              0x3FUL                                     /**< Bit mask for VIT_STATEMIN                   */
#define _VIT_STAT_STATEMIN_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_STATEMIN_DEFAULT            (_VIT_STAT_STATEMIN_DEFAULT << 0)          /**< Shifted mode DEFAULT for VIT_STAT           */
#define _VIT_STAT_SB_SHIFT                   8                                          /**< Shift value for VIT_SB                      */
#define _VIT_STAT_SB_MASK                    0x3F00UL                                   /**< Bit mask for VIT_SB                         */
#define _VIT_STAT_SB_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_SB_DEFAULT                  (_VIT_STAT_SB_DEFAULT << 8)                /**< Shifted mode DEFAULT for VIT_STAT           */
#define VIT_STAT_FRAMEAVAIL                  (0x1UL << 16)                              /**< New BitField                                */
#define _VIT_STAT_FRAMEAVAIL_SHIFT           16                                         /**< Shift value for VIT_FRAMEAVAIL              */
#define _VIT_STAT_FRAMEAVAIL_MASK            0x10000UL                                  /**< Bit mask for VIT_FRAMEAVAIL                 */
#define _VIT_STAT_FRAMEAVAIL_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_FRAMEAVAIL_DEFAULT          (_VIT_STAT_FRAMEAVAIL_DEFAULT << 16)       /**< Shifted mode DEFAULT for VIT_STAT           */
#define VIT_STAT_SYNDACTIVE                  (0x1UL << 24)                              /**< New BitField                                */
#define _VIT_STAT_SYNDACTIVE_SHIFT           24                                         /**< Shift value for VIT_SYNDACTIVE              */
#define _VIT_STAT_SYNDACTIVE_MASK            0x1000000UL                                /**< Bit mask for VIT_SYNDACTIVE                 */
#define _VIT_STAT_SYNDACTIVE_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_SYNDACTIVE_DEFAULT          (_VIT_STAT_SYNDACTIVE_DEFAULT << 24)       /**< Shifted mode DEFAULT for VIT_STAT           */
#define VIT_STAT_SYNDTOG                     (0x1UL << 25)                              /**< New BitField                                */
#define _VIT_STAT_SYNDTOG_SHIFT              25                                         /**< Shift value for VIT_SYNDTOG                 */
#define _VIT_STAT_SYNDTOG_MASK               0x2000000UL                                /**< Bit mask for VIT_SYNDTOG                    */
#define _VIT_STAT_SYNDTOG_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_SYNDTOG_DEFAULT             (_VIT_STAT_SYNDTOG_DEFAULT << 25)          /**< Shifted mode DEFAULT for VIT_STAT           */
#define VIT_STAT_SYNDAVAIL                   (0x1UL << 26)                              /**< New BitField                                */
#define _VIT_STAT_SYNDAVAIL_SHIFT            26                                         /**< Shift value for VIT_SYNDAVAIL               */
#define _VIT_STAT_SYNDAVAIL_MASK             0x4000000UL                                /**< Bit mask for VIT_SYNDAVAIL                  */
#define _VIT_STAT_SYNDAVAIL_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_SYNDAVAIL_DEFAULT           (_VIT_STAT_SYNDAVAIL_DEFAULT << 26)        /**< Shifted mode DEFAULT for VIT_STAT           */
#define VIT_STAT_DEPUNCTALARM                (0x1UL << 27)                              /**< New BitField                                */
#define _VIT_STAT_DEPUNCTALARM_SHIFT         27                                         /**< Shift value for VIT_DEPUNCTALARM            */
#define _VIT_STAT_DEPUNCTALARM_MASK          0x8000000UL                                /**< Bit mask for VIT_DEPUNCTALARM               */
#define _VIT_STAT_DEPUNCTALARM_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for VIT_STAT                   */
#define VIT_STAT_DEPUNCTALARM_DEFAULT        (_VIT_STAT_DEPUNCTALARM_DEFAULT << 27)     /**< Shifted mode DEFAULT for VIT_STAT           */

/* Bit fields for VIT FRAMEOUT */
#define _VIT_FRAMEOUT_RESETVALUE             0x00000000UL                               /**< Default value for VIT_FRAMEOUT              */
#define _VIT_FRAMEOUT_MASK                   0x0000FFFFUL                               /**< Mask for VIT_FRAMEOUT                       */
#define _VIT_FRAMEOUT_LENGTH_SHIFT           0                                          /**< Shift value for VIT_LENGTH                  */
#define _VIT_FRAMEOUT_LENGTH_MASK            0xFFFFUL                                   /**< Bit mask for VIT_LENGTH                     */
#define _VIT_FRAMEOUT_LENGTH_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for VIT_FRAMEOUT               */
#define VIT_FRAMEOUT_LENGTH_DEFAULT          (_VIT_FRAMEOUT_LENGTH_DEFAULT << 0)        /**< Shifted mode DEFAULT for VIT_FRAMEOUT       */

/* Bit fields for VIT SYNDROME */
#define _VIT_SYNDROME_RESETVALUE             0x00000000UL                               /**< Default value for VIT_SYNDROME              */
#define _VIT_SYNDROME_MASK                   0xFFFFFFFFUL                               /**< Mask for VIT_SYNDROME                       */
#define _VIT_SYNDROME_ERR_SHIFT              0                                          /**< Shift value for VIT_ERR                     */
#define _VIT_SYNDROME_ERR_MASK               0xFFFFUL                                   /**< Bit mask for VIT_ERR                        */
#define _VIT_SYNDROME_ERR_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_SYNDROME               */
#define VIT_SYNDROME_ERR_DEFAULT             (_VIT_SYNDROME_ERR_DEFAULT << 0)           /**< Shifted mode DEFAULT for VIT_SYNDROME       */
#define _VIT_SYNDROME_CNT_SHIFT              16                                         /**< Shift value for VIT_CNT                     */
#define _VIT_SYNDROME_CNT_MASK               0xFFFF0000UL                               /**< Bit mask for VIT_CNT                        */
#define _VIT_SYNDROME_CNT_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for VIT_SYNDROME               */
#define VIT_SYNDROME_CNT_DEFAULT             (_VIT_SYNDROME_CNT_DEFAULT << 16)          /**< Shifted mode DEFAULT for VIT_SYNDROME       */

/* Bit fields for VIT IF */
#define _VIT_IF_RESETVALUE                   0x00000000UL                               /**< Default value for VIT_IF                    */
#define _VIT_IF_MASK                         0x00000001UL                               /**< Mask for VIT_IF                             */
#define VIT_IF_DONE                          (0x1UL << 0)                               /**< New BitField                                */
#define _VIT_IF_DONE_SHIFT                   0                                          /**< Shift value for VIT_DONE                    */
#define _VIT_IF_DONE_MASK                    0x1UL                                      /**< Bit mask for VIT_DONE                       */
#define _VIT_IF_DONE_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for VIT_IF                     */
#define VIT_IF_DONE_DEFAULT                  (_VIT_IF_DONE_DEFAULT << 0)                /**< Shifted mode DEFAULT for VIT_IF             */

/* Bit fields for VIT IEN */
#define _VIT_IEN_RESETVALUE                  0x00000000UL                               /**< Default value for VIT_IEN                   */
#define _VIT_IEN_MASK                        0x00000001UL                               /**< Mask for VIT_IEN                            */
#define VIT_IEN_DONE                         (0x1UL << 0)                               /**< New BitField                                */
#define _VIT_IEN_DONE_SHIFT                  0                                          /**< Shift value for VIT_DONE                    */
#define _VIT_IEN_DONE_MASK                   0x1UL                                      /**< Bit mask for VIT_DONE                       */
#define _VIT_IEN_DONE_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for VIT_IEN                    */
#define VIT_IEN_DONE_DEFAULT                 (_VIT_IEN_DONE_DEFAULT << 0)               /**< Shifted mode DEFAULT for VIT_IEN            */

/** @} End of group EFR32FG25_VIT_BitFields */
/** @} End of group EFR32FG25_VIT */
/** @} End of group Parts */

#endif /* EFR32FG25_VIT_H */
